#!/usr/bin/env python
# -*- coding: utf-8 -*-

# $Id: jthis.py 80 2013-11-22 07:02:28Z t1 $
# $Revision: 80 $
# $Date: 2013-11-22 16:02:28 +0900 (Fri, 22 Nov 2013) $
# $Author: t1 $
# $LastChangedBy: t1 $
# $LastChangedDate: 2013-11-22 16:02:28 +0900 (Fri, 22 Nov 2013) $

r"""\
Name: jthis.py
"""

print(u"""
きたないのよりきれいな方がいい
ごちゃごちゃ難しいのより、白黒はっきりしてるのがいい
めんどうなのよりかんたんな方がいい
けど、訳分かんなくなるくらいならめんどうな方がまし
ネストさせなくていいならしない方がいい
たくさん詰め込んだのよりスカスカな方がいい
読みやすさがたいせつなのよ
特別なこともあるけど掟破りってほどじゃない
実用性を求めてくと、ちょっとはずれちゃうこともあるけどね
わざとそうしてるんじゃない限り
エラーをだまって通すようなことがあっちゃいけません
あいまいなことをてきとーに処理しちゃいけません
間違えようのないやり方がひとつだけあるのがいいね
オランダ人以外には、ちょっと分かりにくかったりしてもね
やらないよりは今やるべき
けど今「すぐ」やるならやんない方がいいこともある
作るものをうまく説明できないようならそれはボツ
うまく説明できたらたぶんそれがグッド
ぶらぼーなアイディア名前空間、やっぱこれですね""")





# For Emacs
# Local Variables:
# coding: utf-8
# End:
# jthis.py ends here
